app/views/searches/show.html.erb

  <strong>Search:</strong>
  <%= @search.search %>
---
SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]