app/controllers/searches_controller.rb

SELECT "searches".* FROM "searches"
---
  def index
    @searches = Search.all

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @twitts = twitter.search(@search.search, result_type: "recent")

INSERT INTO "searches" ("search", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["search", "justin bieber"], ["created_at", "2017-11-27 15:59:55.362785"], ["updated_at", "2017-11-27 15:59:55.362785"]]
---
  def create
    @search = Search.new(search_params)

    respond_to do |format|
      if @search.save

DELETE FROM "searches" WHERE "searches"."id" = $1  [["id", 2]]
---
  def destroy
    @search.destroy

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_search
      @search = Search.find(params[:id])